---
kind: property
id: P:Autodesk.Revit.DB.Events.FileImportingEventArgs.Path
source: html/8955ee23-6210-bfea-fc29-b84d5855de12.htm
---
# Autodesk.Revit.DB.Events.FileImportingEventArgs.Path Property

Path of the source file which is about to be imported.

## Syntax (C#)
```csharp
public string Path { get; }
```